Tekla Open API Reference for Tekla Structures 2025
OBB.DistanceTo Method
Overload List
Name | Description
DistanceTo(Line)
 Calculates the distance from OBB to given Line.
DistanceTo(LineSegment)
 Calculates the distance from OBB to given LineSegment.
DistanceTo(Point)
 Calculates the distance from OBB to given point.
Top
See Also
Reference
OBB Class
Tekla.Structures.Geometry3d Namespace